{
  "HELLO": "Hello",
  "WELCOME": "Welcome",
  "WELCOMEDESCRIPTION": "I'm Alejandro, a 28-year-old web developer with a great passion for technology and science. I'm currently pursuing a Bachelor's degree in Computer Science at the National University of Rosario, which allows me to delve deeper into the theoretical and practical foundations of programming. I'm committed to web development, continuous learning, and promoting Angular as a development framework and its applications.",
  "MENUTITLE": "Projects",
  "MAINTITLE": "Main",
  "LANGUAGE_ENGLISH": "English Lang",
  "DARK_THEME": "Dark Theme",
  "ANGULAR_FORMS_DESC": "Form design and validation work. To validate the fields, I used the ğ˜ğ˜¢ğ˜­ğ˜ªğ˜¥ğ˜¢ğ˜µğ˜°ğ˜³ğ˜´ service, leveraging predefined functions like ğ˜™ğ˜¦ğ˜²ğ˜¶ğ˜ªğ˜³ğ˜¦ğ˜¥ and ğ˜”ğ˜ªğ˜¯ğ˜“ğ˜¦ğ˜¯ğ˜¨ğ˜µğ˜©, as well as developing custom validators such as ğ˜¯ğ˜¶ğ˜®ğ˜¦ğ˜³ğ˜ªğ˜¤ğ˜ğ˜¢ğ˜­ğ˜ªğ˜¥ğ˜¢ğ˜µğ˜°ğ˜³, ğ˜±ğ˜¢ğ˜´ğ˜´ğ˜¸ğ˜°ğ˜³ğ˜¥ğ˜ğ˜¢ğ˜­ğ˜ªğ˜¥ğ˜¢ğ˜µğ˜°ğ˜³, and ğ˜®ğ˜ªğ˜´ğ˜®ğ˜¢ğ˜µğ˜¤ğ˜©ğ˜—ğ˜¢ğ˜´ğ˜´ğ˜¸ğ˜°ğ˜³ğ˜¥ğ˜ğ˜¢ğ˜­ğ˜ªğ˜¥ğ˜¢ğ˜µğ˜°ğ˜³. I also implemented clear error messages below each field, providing real-time feedback and improving the user experience.",
  "ACTIVITY_DELEGATOR_TITLE": "Activity Delegator",
  "ACTIVITY_DELEGATOR_DESC": "The Activity Delegator app allows users to randomly assign activities to a group of participants, optimizing the equal distribution of tasks. This system ensures that the same participants are not repeated for the same activities for at least three days, as long as the number of activities and participants allows it.",
  "ECOMMERCE_DESC": "This Angular e-commerce application offers a modern, optimized shopping experience, leveraging the framework's power to create a harmonious and fluid front-end. It stands out from other e-commerce platforms due to its advanced admin panel, integrating real-time data and sales analysis. Users can intuitively manage products, orders, and customers, while analytical tools provide insights into trends, enabling informed decisions to maximize sales and enhance the user experience.",
  "ECOMMERCE_CLIENT_DESC": "For the client side of this e-commerce, Angular version 18 is used to leverage the latest framework features. The application takes advantage of new declarative directives @if, @for, and @switch, simplifying template logic. The inject method is also employed, and the structure is optimized through pipes, allowing the code to remain modular and clear. Responsibility is separated through services, with well-organized views and components to provide a coherent and scalable user experience.",
  "ECOMMERCE_SERVER_DESC": "This project is a server API for an eCommerce platform, developed in Node.js using the Express.js framework and structured under the Model-View-Controller (MVC) pattern. The API provides full functionality for managing products, users, shopping carts, and orders, optimized to serve as the foundation for eCommerce applications.",
  "BACK_BTN": "Back to Main",
  "COPYRIGHT": "Copyright",
  "LINKS": "Links",
  "TEST_APP": "Test App",
  "GO_REPOSITORY": "View Repository",
  "TECHNOLOGIES": "Technologies",
  "DOWNLOAD_CV": "Download CV"
}
